import csv

header = ["Книга", "Автор", "Год выпуска"]
rows = [["Портрет Дориана Грея", "Оскар Уайльд", "1890"],
        ["Евгений Онегин", "А. С. Пушкин", "1831"],
        ["Преступление и Наказание", "Ф. М. Достоевский", "1866"],
        ["Тени в раю", "Эрих Мария Ремарк", "1971"],
        ["Джейн Эйр", "Шарлотта Бронте", "1847"]]

with open("Books.csv", "w", newline='') as f:
    writer = csv.writer(f, delimiter=",")
    writer.writerow(header)
    writer.writerows(rows)
print("Создание файла завершено")
